TesboCFD/tutorials/incompressible/pimpleFoam/LES/NACA4412/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    timeInterval    1;

    log             no;

    AoA             13.87;       // Angle-of-attack
    magUInf         1.0;         // Freestream velocity
    lRef            1.0;         // Chord length
    Aref            #eval{ $lRef*0.004 };  // Chord length times span width

    patches         (aerofoil);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1;           // Required when rho = rhoInf
    liftDir         (
                        #eval{-sin(degToRad($AoA))} 
                        0 
                        #eval{cos(degToRad($AoA))}
                    );
    dragDir         (
                        #eval{cos(degToRad($AoA))} 
                        0 
                        #eval{sin(degToRad($AoA))}
                    );
    CofR            (0.25 0 0);  // Aerodynamic center point
    pitchAxis       (0 1 0);
}


// ************************************************************************* //
